_posts/dev/2018-10-11-rails-path.html
---
layout: post
title: "Rails 项目路径结构"
date: 2018-10-11
categories: 程序设计
tags:
    - Rails
---

<div id="outline-container-orgf3cff15" class="outline-2">
<h2 id="orgf3cff15"><span class="section-number-2">1</span> app/</h2>
<div class="outline-text-2" id="text-1">
<p>
app 目录是你主要工作的地方，不同子目录存放了
Models、Controllers、Views、Helpers 和 Assets 等档案。
</p>
</div>

<div id="outline-container-orgbc2515c" class="outline-3">
<h3 id="orgbc2515c"><span class="section-number-3">1.1</span> app/controllers</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Controller 的类别档案存放在这里
</p>
</div>
</div>

<div id="outline-container-orgd03fc59" class="outline-3">
<h3 id="orgd03fc59"><span class="section-number-3">1.2</span> app/models</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Model 的类别档案存放在这里
</p>
</div>
</div>

<div id="outline-container-org7be2acd" class="outline-3">
<h3 id="org7be2acd"><span class="section-number-3">1.3</span> app/views</h3>
<div class="outline-text-3" id="text-1-3">
<p>
View 的样本(template)档案，依照不同 Controllers 分子目录存放。
</p>
</div>
</div>

<div id="outline-container-orgbb09396" class="outline-3">
<h3 id="orgbb09396"><span class="section-number-3">1.4</span> app/helpers</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Helper 一些在 Views 中可以使用的小方法，用来产生较复杂的 HTML。默认的
Helper 档案命名是对应 Controller 的，不过并不强制，定义在任一个 Helper
档案中的方法，都可以在任何 Views 中使用。
</p>
</div>
</div>

<div id="outline-container-org2178466" class="outline-3">
<h3 id="org2178466"><span class="section-number-3">1.5</span> app/assets</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Assets 静态档案存放在这里，包括有 JavaScript、Stylesheets 样式表和
Images 图档。详细的用法会在 Assets 一章中介绍。
</p>
</div>
</div>
</div>

<div id="outline-container-org6fc3c29" class="outline-2">
<h2 id="org6fc3c29"><span class="section-number-2">2</span> config/</h2>
<div class="outline-text-2" id="text-2">
<p>
虽然 Rails
的原则是惯例优于设定，不过还是有一些需要设定的地方。这个目录下存放了例如数据库设定档
database.yml、路由设定 routes.rb、应用程式设定档 application.rb
和不同执行环境的设定档在 config/environments 目录下。
</p>
</div>
</div>

<div id="outline-container-orgb1e3c0a" class="outline-2">
<h2 id="orgb1e3c0a"><span class="section-number-2">3</span> db/</h2>
<div class="outline-text-2" id="text-3">
<p>
数据库 Schema(纲要) 和定义档 migrations
</p>
</div>
</div>

<div id="outline-container-orgf7f340f" class="outline-2">
<h2 id="orgf7f340f"><span class="section-number-2">4</span> lib/</h2>
<div class="outline-text-2" id="text-4">
<p>
如果你有一些共享的类别或模块档案，可以放在这里，然后用 require
加载。例如一个放在 lib/foobar.rb 的类别或模组档案，可以在要使用的 .rb
档案中这样加载：
</p>

<pre class="example">
require "foobar"
</pre>

<p>
如果放在子目录 lib/foo/bar.rb 的话：
</p>

<pre class="example">
require "foo/bar
</pre>
</div>

<div id="outline-container-org86ba7f7" class="outline-3">
<h3 id="org86ba7f7"><span class="section-number-3">4.1</span> lib/tasks</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Rake 任务档案存放在这里，我们会在 Rails 锦囊妙计 一章介绍 Rake。
</p>
</div>
</div>
</div>

<div id="outline-container-orgac55dee" class="outline-2">
<h2 id="orgac55dee"><span class="section-number-2">5</span> log/</h2>
<div class="outline-text-2" id="text-5">
<p>
不同执行环境的 log 档案会分别记录在这里
</p>
</div>
</div>

<div id="outline-container-org0608bc5" class="outline-2">
<h2 id="org0608bc5"><span class="section-number-2">6</span> public/</h2>
<div class="outline-text-2" id="text-6">
<p>
这个目录对 Web 服务器来说，就是文件根目录(document
root)，也就是唯一可以在网络上读取到的目录。
</p>
</div>
</div>

<div id="outline-container-orgbf32ac5" class="outline-2">
<h2 id="orgbf32ac5"><span class="section-number-2">7</span> bin/</h2>
<div class="outline-text-2" id="text-7">
<p>
Rails 的脚本档案，例如执行 bin/rake。
</p>
</div>
</div>

<div id="outline-container-org0cf78a6" class="outline-2">
<h2 id="org0cf78a6"><span class="section-number-2">8</span> test/</h2>
<div class="outline-text-2" id="text-8">
<p>
单元测试、功能测试及整合测试的档案。本书会改用 RSpec
做测试，所以这一个目录会被砍掉。RSpec 的测试档案会放在 spec/目录下。
</p>
</div>
</div>

<div id="outline-container-org71a5597" class="outline-2">
<h2 id="org71a5597"><span class="section-number-2">9</span> tmp/</h2>
<div class="outline-text-2" id="text-9">
<p>
. 用来存放暂时用途的档案
</p>
</div>
</div>

<div id="outline-container-org71d9f71" class="outline-2">
<h2 id="org71d9f71"><span class="section-number-2">10</span> vendor/</h2>
<div class="outline-text-2" id="text-10">
<p>
第三方的函式库。
</p>
</div>

<div id="outline-container-org1b128d7" class="outline-3">
<h3 id="org1b128d7"><span class="section-number-3">10.1</span> vendor/assets</h3>
<div class="outline-text-3" id="text-10-1">
<p>
可将第三方的 CSS/JavaScript 函式库(没有提供 Gem
安装版本的)复制一份放在这里。
</p>
</div>
</div>
</div>

<div id="outline-container-org26e114b" class="outline-2">
<h2 id="org26e114b"><span class="section-number-2">11</span> 其他根目录下的档案</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>config.ru 用来启动应用程式的 Rack 设定档</li>
<li>Gemfile 设定你的 Rails 应用程式会使用哪些 Gems</li>
<li>README.md
你的应用程式使用手册。你可以用来告诉其他人你的应用程式是做什么用的，如何使用等等。这会是
Github 上的专案首页。</li>
<li>Rakefile 用来加载可以被命令列执行的 Rake 任务</li>
</ul>
</div>
</div>

<div id="outline-container-org9667712" class="outline-2">
<h2 id="org9667712"><span class="section-number-2">12</span> References</h2>
<div class="outline-text-2" id="text-12">
<blockquote>
<p>
本文是我的学习笔记，内容参考了网上资源，为了方便自己查询使用，做了一些修改整理。
笔记内容摘录于下列文章，相应权利归属原作者，如有未列出的或有不妥，请联系我立即增补或删除。
</p>
</blockquote>
</div>
</div>
